Revit 2027 API
BuiltInFailures.RebarFailures.BarTypeDoesNotAllowHooksOfCurrentShape Property
 You have selected a Bar Type which does not allow the Hooks used by the current shape. Please select a different Shape / Bar Type combination, or change the Hook permissions for the desired Bar Type (see Hook Lengths under Rebar Bar properties).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BarTypeDoesNotAllowHooksOfCurrentShape { get; }
Public Shared ReadOnly Property BarTypeDoesNotAllowHooksOfCurrentShape As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BarTypeDoesNotAllowHooksOfCurrentShape {
	FailureDefinitionId^ get ();
}
static member BarTypeDoesNotAllowHooksOfCurrentShape : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace